Data/Raw data/Varying threads (only workload A, constant record count, target)/couchbase_threads/threads_8/output.txt
[OVERALL], RunTime(ms), 3082
[OVERALL], Throughput(ops/sec), 1622.3231667748216
[TOTAL_GCS_PS_Scavenge], Count, 4
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 52
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.6872160934458142
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 52
[TOTAL_GC_TIME_%], Time(%), 1.6872160934458142
[READ], Operations, 2466
[READ], AverageLatency(us), 2196.8264395782644
[READ], MinLatency(us), 100
[READ], MaxLatency(us), 65855
[READ], 95thPercentileLatency(us), 8479
[READ], 99thPercentileLatency(us), 16127
[READ], Return=OK, 2466
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 0.125
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[UPDATE], Operations, 2534
[UPDATE], AverageLatency(us), 2253.518153117601
[UPDATE], MinLatency(us), 113
[UPDATE], MaxLatency(us), 121791
[UPDATE], 95thPercentileLatency(us), 8115
[UPDATE], 99thPercentileLatency(us), 16639
[UPDATE], Return=OK, 2534